import pytest


@pytest.fixture
def get_transactions() -> list:
    """Фикстура, возвращающая список транзакций"""
    return [
        {
            "Дата операции": "10.01.2018 12:41:24",
            "Номер карты": "*5441",
            "Статус": "OK",
            "Сумма платежа": -567.53,
            "Кэшбэк": 5.0,
        },
        {
            "Дата операции": "12.01.2018 11:10:05",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма платежа": -87068.0,
            "Кэшбэк": 870.00,
        },
        {
            "Дата операции": "15.01.2018 08:15:55",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма платежа": -1000.0,
            "Кэшбэк": 10.0,
        },
        {
            "Дата операции": "19.01.2018 21:07:17",
            "Номер карты": "*5441",
            "Статус": "OK",
            "Сумма платежа": -10000.0,
            "Кэшбэк": 10.0,
        },
        {
            "Дата операции": "20.01.2018 12:22:00",
            "Номер карты": "*5441",
            "Статус": "OK",
            "Сумма платежа": 15000.0,
            "Кэшбэк": 0,
        },
    ]


@pytest.fixture
def get_expected() -> dict:
    """Фикстура, возвращающая словарь с транзакциями,
    сгруппированными по номеру карты"""
    return {
        "Номер карты": "*4556",
        "Транзакции": [
            {
                "Дата операции": "12.01.2018 11:10:05",
                "Кэшбэк": 870.0,
                "Номер карты": "*4556",
                "Статус": "OK",
                "Сумма платежа": -87068.0,
            },
            {
                "Дата операции": "15.01.2018 08:15:55",
                "Кэшбэк": 10.0,
                "Номер карты": "*4556",
                "Статус": "OK",
                "Сумма платежа": -1000.0,
            },
        ],
    }


@pytest.fixture
def get_transactions_1() -> list:
    """Фикстура, возвращающая список транзакций по одной карте"""
    return [
        {
            "Номер карты": "*4556",
            "Транзакции": [
                {
                    "Дата операции": "12.01.2018 11:10:05",
                    "Кэшбэк": 870.0,
                    "Номер карты": "*4556",
                    "Статус": "OK",
                    "Сумма платежа": -87068.0,
                },
                {
                    "Дата операции": "15.01.2018 08:15:55",
                    "Кэшбэк": 10.0,
                    "Номер карты": "*4556",
                    "Статус": "OK",
                    "Сумма платежа": -1000.0,
                },
            ],
        },
    ]


@pytest.fixture
def get_transactions_2() -> list:
    """Фикстура, возвращающая список транзакций с категориями и описанием"""
    return [
        {
            "Дата операции": "10.01.2018 12:41:24",
            "Номер карты": "*5441",
            "Сумма платежа": -567.53,
            "Категория": "Супермаркеты",
            "Описание": "Оплата покупок",
        },
        {
            "Дата операции": "12.01.2018 11:10:05",
            "Номер карты": "*4556",
            "Сумма платежа": -87068.0,
            "Категория": "Путешествия",
            "Описание": "Оплата отеля",
        },
        {
            "Дата операции": "15.01.2018 08:15:55",
            "Номер карты": "*4556",
            "Сумма платежа": -1000.0,
            "Категория": "Переводы физическим лицам",
            "Описание": "Перевод с карты на карту",
        },
    ]
